In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')
import math
%matplotlib inline

In [2]:
df=pd.read_csv("student.csv")

In [3]:
df

,StudentID,Name,Age,Gender,StudyHours,Attendance,Marks,Grade,City
0,1,Aarav,18.0,M,3.0,85.0,72.0,B,Pune
1,2,Ananya,19.0,F,5.0,90.0,88.0,A,Mumbai
2,3,Rohan,20.0,M,NaN,70.0,60.0,C,Nashik
3,4,Priya,18.0,F,4.0,95.0,92.0,A,NaN
4,5,Kunal,21.0,M,1.0,65.0,55.0,D,Mumbai
5,6,Sneha,19.0,F,6.0,98.0,96.0,A,Nagpur
6,7,Aditya,20.0,M,3.0,NaN,75.0,B,Pune
7,8,Neha,18.0,F,NaN,88.0,78.0,B,Nashik
8,9,Vikas,22.0,M,2.0,60.0,NaN,D,Mumbai
9,10,Pooja,19.0,F,4.0,85.0,82.0,B,Pune
10,11,Rahul,20.0,M,5.0,92.0,89.0,A,Nagpur
11,12,Meera,21.0,F,3.0,NaN,70.0,NaN,Mumbai
12,13,Amit,18.0,M,NaN,75.0,68.0,C,Pune
13,14,Kavya,19.0,F,6.0,96.0,94.0,A,Nashik
14,15,Suresh,22.0,M,1.0,55.0,45.0,D,NaN
15,16,Ritu,20.0,F,4.0,82.0,80.0,B,Mumbai
16,17,Manish,NaN,M,3.0,78.0,73.0,B,Nagpur
17,18,Nikita,18.0,F,5.0,90.0,NaN,A,Pune
18,19,Arjun,19.0,M,NaN,68.0,65.0,C,Nashik
19,20,Isha,20.0,F,6.0,95.0,93.0,A,Mumbai
20,21,Deepak,22.0,M,2.0,NaN,66.0,C,Pune
21,22,Komal,18.0,F,4.0,88.0,85.0,B,NaN
22,23,Sanjay,21.0,M,3.0,80.0,74.0,NaN,Mumbai
23,24,Shreya,19.0,F,5.0,92.0,90.0,A,Pune
24,25,Ritesh,20.0,M,1.0,60.0,52.0,D,Nashik
25,26,Anjali,NaN,F,6.0,97.0,95.0,A,Mumbai
26,27,Mohit,21.0,M,2.0,70.0,NaN,C,Pune
27,28,Payal,19.0,F,NaN,85.0,83.0,B,Nagpur
28,29,Nitin,22.0,M,3.0,NaN,71.0,C,Mumbai
29,30,Aditi,20.0,F,5.0,90.0,88.0,A,Pune

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   StudentID   30 non-null     int64
 1   Name        30 non-null     object
 2   Age         28 non-null     float64
 3   Gender      30 non-null     object
 4   StudyHours  25 non-null     float64
 5   Attendance  26 non-null     float64
 6   Marks       27 non-null     float64
 7   Grade       28 non-null     object
 8   City        27 non-null     object
dtypes: float64(4), int64(1), object(4)
memory usage: 2.2+ KB

In [5]:
df.duplicated().sum()

np.int64(0)

In [6]:
df.nunique()

StudentID     30
Name          30
Age            5
Gender         2
StudyHours     6
Attendance    17
Marks         26
Grade          4
City           4
dtype: int64

In [7]:
print("StudyHours:",df.StudyHours.unique())
print("Age",df.Age.unique())
print("Grade",df.Grade.unique())
print("City",df.City.unique())

StudyHours: [ 3.  5. nan  4.  1.  6.  2.]
Age [18. 19. 20. 21. 22. nan]
Grade ['B' 'A' 'C' 'D' nan]
City ['Pune' 'Mumbai' 'Nashik' nan 'Nagpur']

In [8]:
df.isnull().sum()

StudentID     0
Name          0
Age           2
Gender        0
StudyHours    5
Attendance    4
Marks         3
Grade         2
City          3
dtype: int64

In [9]:
# Using Pandas
avg_age=df.Age.mean()
avg_StudyHours=df.StudyHours.mean()
avg_Attendance=df.Attendance.mean()
avg_Marks=df.Marks.mean()
#freq_Grade=df.Grade.dropna().mode()[0]   # [0]:retrives the 1st mode from the resulting series
freq_City=df.City.dropna().mode()[0]

df.Age.replace(np.nan,avg_age, inplace = True)
df.StudyHours.replace(np.nan,avg_StudyHours, inplace = True)
df.Attendance.replace(np.nan,avg_Attendance, inplace = True)
df.Marks.replace(np.nan,avg_Marks, inplace = True)
#df.Grade.replace(np.nan,freq_Grade, inplace = True)
df.City.replace(np.nan,freq_City, inplace = True)

In [10]:
df.loc[df['Grade'].isna() & (df['Marks'] >= 90), 'Grade'] = 'A'
df.loc[df['Grade'].isna() & (df['Marks'] >= 75) & (df['Marks'] < 90), 'Grade'] = 'B'
df.loc[df['Grade'].isna() & (df['Marks'] >= 60) & (df['Marks'] < 75), 'Grade'] = 'C'
df.loc[df['Grade'].isna() & (df['Marks'] < 60), 'Grade'] = 'D'

In [11]:
df

,StudentID,Name,Age,Gender,StudyHours,Attendance,Marks,Grade,City
0,1,Aarav,18.00,M,3.00,85.000000,72.0,B,Pune
1,2,Ananya,19.00,F,5.00,90.000000,88.0,A,Mumbai
2,3,Rohan,20.00,M,3.68,70.000000,60.0,C,Nashik
3,4,Priya,18.00,F,4.00,95.000000,92.0,A,Mumbai
4,5,Kunal,21.00,M,1.00,65.000000,55.0,D,Mumbai
5,6,Sneha,19.00,F,6.00,98.000000,96.0,A,Nagpur
6,7,Aditya,20.00,M,3.00,81.884615,75.0,B,Pune
7,8,Neha,18.00,F,3.68,88.000000,78.0,B,Nashik
8,9,Vikas,22.00,M,2.00,60.000000,77.0,D,Mumbai
9,10,Pooja,19.00,F,4.00,85.000000,82.0,B,Pune
10,11,Rahul,20.00,M,5.00,92.000000,89.0,A,Nagpur
11,12,Meera,21.00,F,3.00,81.884615,70.0,C,Mumbai
12,13,Amit,18.00,M,3.68,75.000000,68.0,C,Pune
13,14,Kavya,19.00,F,6.00,96.000000,94.0,A,Nashik
14,15,Suresh,22.00,M,1.00,55.000000,45.0,D,Mumbai
15,16,Ritu,20.00,F,4.00,82.000000,80.0,B,Mumbai
16,17,Manish,19.75,M,3.00,78.000000,73.0,B,Nagpur
17,18,Nikita,18.00,F,5.00,90.000000,77.0,A,Pune
18,19,Arjun,19.00,M,3.68,68.000000,65.0,C,Nashik
19,20,Isha,20.00,F,6.00,95.000000,93.0,A,Mumbai
20,21,Deepak,22.00,M,2.00,81.884615,66.0,C,Pune
21,22,Komal,18.00,F,4.00,88.000000,85.0,B,Mumbai
22,23,Sanjay,21.00,M,3.00,80.000000,74.0,C,Mumbai
23,24,Shreya,19.00,F,5.00,92.000000,90.0,A,Pune
24,25,Ritesh,20.00,M,1.00,60.000000,52.0,D,Nashik
25,26,Anjali,19.75,F,6.00,97.000000,95.0,A,Mumbai
26,27,Mohit,21.00,M,2.00,70.000000,77.0,C,Pune
27,28,Payal,19.00,F,3.68,85.000000,83.0,B,Nagpur
28,29,Nitin,22.00,M,3.00,81.884615,71.0,C,Mumbai
29,30,Aditi,20.00,F,5.00,90.000000,88.0,A,Pune

In [12]:
from sklearn.preprocessing import MinMaxScaler
scaler = MinMaxScaler()
df[['StudyHours','Attendance','Marks']] = scaler.fit_transform(df[['StudyHours','Attendance','Marks']])
df.head()

,StudentID,Name,Age,Gender,StudyHours,Attendance,Marks,Grade,City
0,1,Aarav,18.0,M,0.400,0.697674,0.529412,B,Pune
1,2,Ananya,19.0,F,0.800,0.813953,0.843137,A,Mumbai
2,3,Rohan,20.0,M,0.536,0.348837,0.294118,C,Nashik
3,4,Priya,18.0,F,0.600,0.930233,0.921569,A,Mumbai
4,5,Kunal,21.0,M,0.000,0.232558,0.196078,D,Mumbai

In [13]:
from sklearn.preprocessing import OneHotEncoder  # string data to numerical
encoder=OneHotEncoder()
df.City=encoder.fit_transform(df[['City']]).toarray()
df.head()

,StudentID,Name,Age,Gender,StudyHours,Attendance,Marks,Grade,City
0,1,Aarav,18.0,M,0.400,0.697674,0.529412,B,0.0
1,2,Ananya,19.0,F,0.800,0.813953,0.843137,A,1.0
2,3,Rohan,20.0,M,0.536,0.348837,0.294118,C,0.0
3,4,Priya,18.0,F,0.600,0.930233,0.921569,A,1.0
4,5,Kunal,21.0,M,0.000,0.232558,0.196078,D,1.0

In [14]:
# Label Encoding
from sklearn.preprocessing import LabelEncoder
encoder = LabelEncoder()
df.Gender=encoder.fit_transform(df[['Gender']])
df.head()

,StudentID,Name,Age,Gender,StudyHours,Attendance,Marks,Grade,City
0,1,Aarav,18.0,1,0.400,0.697674,0.529412,B,0.0
1,2,Ananya,19.0,0,0.800,0.813953,0.843137,A,1.0
2,3,Rohan,20.0,1,0.536,0.348837,0.294118,C,0.0
3,4,Priya,18.0,0,0.600,0.930233,0.921569,A,1.0
4,5,Kunal,21.0,1,0.000,0.232558,0.196078,D,1.0

In [15]:
# Label Encoding
from sklearn.preprocessing import LabelEncoder
encoder = LabelEncoder()
df.Grade=encoder.fit_transform(df[['Grade']])
df.head()

,StudentID,Name,Age,Gender,StudyHours,Attendance,Marks,Grade,City
0,1,Aarav,18.0,1,0.400,0.697674,0.529412,1,0.0
1,2,Ananya,19.0,0,0.800,0.813953,0.843137,0,1.0
2,3,Rohan,20.0,1,0.536,0.348837,0.294118,2,0.0
3,4,Priya,18.0,0,0.600,0.930233,0.921569,0,1.0
4,5,Kunal,21.0,1,0.000,0.232558,0.196078,3,1.0

In [18]:
# Separating Independent and dependent feature(s)
X = df[['Age','Gender','StudyHours','Attendance']].values
X             # Independent feature set

array([[18.        ,  1.        ,  0.4       ,  0.69767442],
       [19.        ,  0.        ,  0.8       ,  0.81395349],
       [20.        ,  1.        ,  0.536     ,  0.34883721],
       [18.        ,  0.        ,  0.6       ,  0.93023256],
       [21.        ,  1.        ,  0.        ,  0.23255814],
       [19.        ,  0.        ,  1.        ,  1.        ],
       [20.        ,  1.        ,  0.4       ,  0.62522361],
       [18.        ,  0.        ,  0.536     ,  0.76744186],
       [22.        ,  1.        ,  0.2       ,  0.11627907],
       [19.        ,  0.        ,  0.6       ,  0.69767442],
       [20.        ,  1.        ,  0.8       ,  0.86046512],
       [21.        ,  0.        ,  0.4       ,  0.62522361],
       [18.        ,  1.        ,  0.536     ,  0.46511628],
       [19.        ,  0.        ,  1.        ,  0.95348837],
       [22.        ,  1.        ,  0.        ,  0.        ],
       [20.        ,  0.        ,  0.6       ,  0.62790698],
       [19.75      ,  1.        ,  0.4       ,  0.53488372],
       [18.        ,  0.        ,  0.8       ,  0.81395349],
       [19.        ,  1.        ,  0.536     ,  0.30232558],
       [20.        ,  0.        ,  1.        ,  0.93023256],
       [22.        ,  1.        ,  0.2       ,  0.62522361],
       [18.        ,  0.        ,  0.6       ,  0.76744186],
       [21.        ,  1.        ,  0.4       ,  0.58139535],
       [19.        ,  0.        ,  0.8       ,  0.86046512],
       [20.        ,  1.        ,  0.        ,  0.11627907],
       [19.75      ,  0.        ,  1.        ,  0.97674419],
       [21.        ,  1.        ,  0.2       ,  0.34883721],
       [19.        ,  0.        ,  0.536     ,  0.69767442],
       [22.        ,  1.        ,  0.4       ,  0.62522361],
       [20.        ,  0.        ,  0.8       ,  0.81395349]])

In [19]:
# Separating dependent and dependent feature(s)
X = df[['Marks','Grade']].values
X             # dependent feature set

array([[0.52941176, 1.        ],
       [0.84313725, 0.        ],
       [0.29411765, 2.        ],
       [0.92156863, 0.        ],
       [0.19607843, 3.        ],
       [1.        , 0.        ],
       [0.58823529, 1.        ],
       [0.64705882, 1.        ],
       [0.62745098, 3.        ],
       [0.7254902 , 1.        ],
       [0.8627451 , 0.        ],
       [0.49019608, 2.        ],
       [0.45098039, 2.        ],
       [0.96078431, 0.        ],
       [0.        , 3.        ],
       [0.68627451, 1.        ],
       [0.54901961, 1.        ],
       [0.62745098, 0.        ],
       [0.39215686, 2.        ],
       [0.94117647, 0.        ],
       [0.41176471, 2.        ],
       [0.78431373, 1.        ],
       [0.56862745, 2.        ],
       [0.88235294, 0.        ],
       [0.1372549 , 3.        ],
       [0.98039216, 0.        ],
       [0.62745098, 2.        ],
       [0.74509804, 1.        ],
       [0.50980392, 2.        ],
       [0.84313725, 0.        ]])